In [1]:
import pandas as pd, sqlite3
customers = pd.read_csv('/kaggle/input/day9-datasets/day_9_customers.csv')
orders = pd.read_csv('/kaggle/input/day9-datasets/day_9_orders.csv')
conn = sqlite3.connect(':memory:')
customers.to_sql('customers', conn, index=False, if_exists='replace')
orders.to_sql('orders', conn, index=False, if_exists='replace')

20

In [2]:
customers.head()

   customer_id         name       city  age                    email
0            1   Aisha Khan      Delhi   21   aisha.khan@example.com
1            2  Rahul Verma     Mumbai   24  rahul.verma@example.com
2            3   Sneha Iyer  Bangalore   23   sneha.iyer@example.com
3            4  Kabir Patel  Ahmedabad   26  kabir.patel@example.com
4            5  Meera Joshi     Mumbai   20  meera.joshi@example.com

In [3]:
orders.head()

   order_id  customer_id  amount     category  order_date     status
0      1001            1     550   Stationery  2025-01-05  Completed
1      1002            2    2200  Electronics  2025-01-10  Completed
2      1003            1     700      Fashion  2025-01-18  Completed
3      1004            3     320   Stationery  2025-02-02    Pending
4      1005            4    1500    Furniture  2025-02-12  Completed

**Show all customers who live in 'Mumbai'**

In [4]:
query = """
SELECT *
FROM customers
WHERE city = 'Mumbai';
"""

pd.read_sql(query, conn)

   customer_id         name    city  age                    email
0            2  Rahul Verma  Mumbai   24  rahul.verma@example.com
1            5  Meera Joshi  Mumbai   20  meera.joshi@example.com
2           15   Sahil Khan  Mumbai   32   sahil.khan@example.com

**List customers aged between 22 and 26 (inclusive).**

In [5]:
query = """
SELECT *
FROM customers
WHERE age BETWEEN 22 and 26;
"""

pd.read_sql(query, conn)

   customer_id             name        city  age                        email
0            2      Rahul Verma      Mumbai   24      rahul.verma@example.com
1            3       Sneha Iyer   Bangalore   23       sneha.iyer@example.com
2            4      Kabir Patel   Ahmedabad   26      kabir.patel@example.com
3            6       Ananya Das     Kolkata   25       ananya.das@example.com
4            8      Simran Kaur  Chandigarh   22      simran.kaur@example.com
5           10       Priya Nair     Chennai   24       priya.nair@example.com
6           16      Pooja Patel   Ahmedabad   26      pooja.patel@example.com
7           17  Ishaan Malhotra        Pune   23  ishaan.malhotra@example.com
8           18      Kavya Menon       Kochi   22      kavya.menon@example.com

**Show orders with amount greater than 1000.**

In [6]:
query = """
SELECT *
FROM orders
WHERE amount > 1000;
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date     status
0      1002            2    2200  Electronics  2025-01-10  Completed
1      1005            4    1500    Furniture  2025-02-12  Completed
2      1007            6    1300  Electronics  2025-03-03     Review
3      1008            7   22000         Home  2025-03-18  Completed
4      1010            9    1299  Electronics  2025-04-02  Completed
5      1011           10    7500    Furniture  2025-04-10    Pending
6      1014           13    2499  Electronics  2025-05-11  Completed
7      1016           15    2200  Electronics  2025-06-03  Completed
8      1019           18    1800    Furniture  2025-07-15    Pending

**Display top 5 orders by amount (highest first).**

In [7]:
query = """
SELECT *
FROM orders
ORDER BY amount desc
LIMIT 5 ;
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date     status
0      1008            7   22000         Home  2025-03-18  Completed
1      1011           10    7500    Furniture  2025-04-10    Pending
2      1014           13    2499  Electronics  2025-05-11  Completed
3      1002            2    2200  Electronics  2025-01-10  Completed
4      1016           15    2200  Electronics  2025-06-03  Completed

**List the 3 youngest customers (age ascending).**

In [8]:
query = """
SELECT *
FROM customers
ORDER BY age asc
LIMIT 3 ;
"""

pd.read_sql(query, conn)

   customer_id         name    city  age                    email
0           12  Tara Sharma   Delhi   19  tara.sharma@example.com
1            5  Meera Joshi  Mumbai   20  meera.joshi@example.com
2            1   Aisha Khan   Delhi   21   aisha.khan@example.com

**Show customers whose name contains 'an' (case-insensitive - use LIKE).**

In [9]:
query = """
SELECT *
FROM customers
WHERE name LIKE '%an%';
"""

pd.read_sql(query, conn)

   customer_id             name        city  age                        email
0            1       Aisha Khan       Delhi   21       aisha.khan@example.com
1            6       Ananya Das     Kolkata   25       ananya.das@example.com
2            7      Rohan Gupta        Pune   27      rohan.gupta@example.com
3            8      Simran Kaur  Chandigarh   22      simran.kaur@example.com
4           11    Devansh Mehta      Jaipur   28    devansh.mehta@example.com
5           15       Sahil Khan      Mumbai   32       sahil.khan@example.com
6           17  Ishaan Malhotra        Pune   23  ishaan.malhotra@example.com

**Show customers located in either 'Delhi', 'Mumbai', or 'Pune' (use IN)**

In [10]:
query = """
SELECT *
FROM customers
WHERE city In ( 'Delhi','Mumbai', 'Pune');
"""

pd.read_sql(query, conn)

   customer_id             name    city  age                        email
0            1       Aisha Khan   Delhi   21       aisha.khan@example.com
1            2      Rahul Verma  Mumbai   24      rahul.verma@example.com
2            5      Meera Joshi  Mumbai   20      meera.joshi@example.com
3            7      Rohan Gupta    Pune   27      rohan.gupta@example.com
4           12      Tara Sharma   Delhi   19      tara.sharma@example.com
5           15       Sahil Khan  Mumbai   32       sahil.khan@example.com
6           17  Ishaan Malhotra    Pune   23  ishaan.malhotra@example.com

**Calculate total revenue across all orders.**

In [11]:
query = """
SELECT SUM(amount)
FROM orders
"""

pd.read_sql(query, conn)

   SUM(amount)
0        46666

**Find the highest and lowest order amounts.**

In [12]:
query = """
SELECT MAX(amount)
FROM orders
"""

pd.read_sql(query, conn)

   MAX(amount)
0        22000

In [13]:
query = """
SELECT MIN(amount)
FROM orders
"""

pd.read_sql(query, conn)

   MIN(amount)
0           60

**Revenue per category (category, SUM(amount)).**

In [14]:
query = """
SELECT category, SUM(amount)
FROM orders
GROUP BY category;
"""

pd.read_sql(query, conn)

      category  SUM(amount)
0  Accessories         1389
1  Electronics         9498
2      Fashion         1600
3    Furniture        10800
4         Home        22350
5   Stationery         1029

**Revenue per customer (customer_id, SUM(amount)).**

In [15]:
query = """
SELECT customer_id, SUM(amount)
FROM orders
GROUP BY customer_id;
"""

pd.read_sql(query, conn)

    customer_id  SUM(amount)
0             1         1250
1             2         3150
2             3          320
3             4         1500
4             5          420
5             6         1300
6             7        22000
7             8          199
8             9         1299
9            10         7500
10           11           60
11           12          240
12           13         2499
13           14          350
14           15         2200
15           16          480
16           17           99
17           18         1800

**Show categories with total revenue > 3000 (use HAVING).**

In [16]:
query = """
SELECT category, SUM(amount) as total_revenue
FROM orders
GROUP BY category
HAVING SUM(amount) > 3000;
"""

pd.read_sql(query, conn)

      category  total_revenue
0  Electronics           9498
1    Furniture          10800
2         Home          22350

**Find customers whose age is greater than the average customer age.**

In [17]:
query = """
SELECT *
FROM customers
WHERE age > (
    SELECT AVG(age) from customers
);
"""

pd.read_sql(query, conn)

   customer_id           name       city  age                      email
0            4    Kabir Patel  Ahmedabad   26    kabir.patel@example.com
1            6     Ananya Das    Kolkata   25     ananya.das@example.com
2            7    Rohan Gupta       Pune   27    rohan.gupta@example.com
3            9   Vikram Singh  Hyderabad   29   vikram.singh@example.com
4           11  Devansh Mehta     Jaipur   28  devansh.mehta@example.com
5           13    Arjun Reddy  Hyderabad   30    arjun.reddy@example.com
6           15     Sahil Khan     Mumbai   32     sahil.khan@example.com
7           16    Pooja Patel  Ahmedabad   26    pooja.patel@example.com

**List customers who have placed at least one order.**

In [18]:
query = """
SELECT *
FROM customers
WHERE customer_id IN (
    SELECT DISTINCT customer_id
    From orders
);
"""

pd.read_sql(query, conn)

    customer_id             name        city  age                        email
0             1       Aisha Khan       Delhi   21       aisha.khan@example.com
1             2      Rahul Verma      Mumbai   24      rahul.verma@example.com
2             3       Sneha Iyer   Bangalore   23       sneha.iyer@example.com
3             4      Kabir Patel   Ahmedabad   26      kabir.patel@example.com
4             5      Meera Joshi      Mumbai   20      meera.joshi@example.com
5             6       Ananya Das     Kolkata   25       ananya.das@example.com
6             7      Rohan Gupta        Pune   27      rohan.gupta@example.com
7             8      Simran Kaur  Chandigarh   22      simran.kaur@example.com
8             9     Vikram Singh   Hyderabad   29     vikram.singh@example.com
9            10       Priya Nair     Chennai   24       priya.nair@example.com
10           11    Devansh Mehta      Jaipur   28    devansh.mehta@example.com
11           12      Tara Sharma       Delhi   19      tara.sharma@example.com
12           13      Arjun Reddy   Hyderabad   30      arjun.reddy@example.com
13           14        Nisha Rao   Bangalore   21        nisha.rao@example.com
14           15       Sahil Khan      Mumbai   32       sahil.khan@example.com
15           16      Pooja Patel   Ahmedabad   26      pooja.patel@example.com
16           17  Ishaan Malhotra        Pune   23  ishaan.malhotra@example.com
17           18      Kavya Menon       Kochi   22      kavya.menon@example.com

**List customers who have never placed an order.**

In [19]:
query = """
SELECT *
FROM customers
WHERE customer_id NOT IN (
    SELECT DISTINCT customer_id
    From orders
);
"""

pd.read_sql(query, conn)

Empty DataFrame
Columns: [customer_id, name, city, age, email]
Index: []

**Find orders with amount greater than the average order amount.**

In [20]:
query = """
SELECT *
FROM orders
WHERE amount > (
    SELECT AVG(amount)
    FROM orders
);
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date     status
0      1008            7   22000         Home  2025-03-18  Completed
1      1011           10    7500    Furniture  2025-04-10    Pending
2      1014           13    2499  Electronics  2025-05-11  Completed

**Find the second highest order amount.**

In [21]:
query = """
SELECT MAX(amount) as second_highest
FROM orders
WHERE amount < (
    SELECT MAX(amount)
    FROM orders
);
"""

pd.read_sql(query, conn)

   second_highest
0            7500

**Find top 2 customers by total spending (customer_id, total_spent).**

In [22]:
query = """
SELECT customer_id, SUM(amount) as total_spent
FROM orders
GROUP BY customer_id
ORDER BY amount DESC
LIMIT 2;
"""

pd.read_sql(query, conn)

   customer_id  total_spent
0            7        22000
1           10         7500